import matplotlib.pyplot as plt
import numpy as np

# 创建数据
x = np.array([2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29,
            30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47,
            48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 67, 68, 70, 71, 72, 73, 74, 77, 79, 85])  # 生成从0到10的100个等间距点
y = np.array([4.981034755706787, 4.981034755706787, 4.981034755706787, 4.654727458953857, 4.269959449768066, 3.6187474727630615, 3.276468515396118, 3.102147340774536, 2.9648919105529785, 2.7695257663726807, 2.862070322036743, 2.830441474914551, 2.6071362495422363, 2.6267752647399902, 2.6361639499664307, 2.525221347808838, 2.603663682937622, 2.4456992149353027, 2.4190893173217773, 2.4614334106445312, 2.5740272998809814, 2.461618661880493, 2.4535574913024902, 2.4487099647521973, 2.4442896842956543, 2.4667787551879883, 2.4515292644500732, 2.460439682006836, 2.4977972507476807, 2.507047414779663, 2.428769588470459, 2.5689949989318848, 2.4125404357910156, 2.5402770042419434, 2.4142024517059326, 2.490432024002075, 2.600637197494507] + [2.474797248840332] * 2 + [2.4605650901794434] * 3 + [2.552619457244873] * 4 + [2.487656593322754] * 27)
y1 = np.array([3.9724862575531006, 3.9724862575531006, 3.9724862575531006, 3.6767919063568115, 3.505838632583618, 2.989149808883667, 2.83364200592041, 2.827512502670288, 2.588071584701538, 2.5301289558410645, 2.3861355781555176, 2.477884292602539, 2.367269277572632, 2.261726140975952, 2.2691142559051514, 2.284722089767456, 2.3927650451660156, 2.332524061203003, 2.297410011291504, 2.2876994609832764, 2.237255096435547, 2.32297945022583, 2.2496631145477295, 2.2665224075317383, 2.275254249572754, 2.2914764881134033, 2.31320858001709, 2.323814630508423, 2.2712512016296387, 2.368576765060425, 2.424960136413574, 2.3999671936035156, 2.356038808822632, 2.4250874519348145, 2.2944157123565674, 2.3815205097198486, 2.4473068714141846] + [2.410219669342041] * 2 + [2.3822968006134033] * 3 + [2.4836671352386475] * 4 + [2.493242025375366] * 27)
plt.figure()
plt.plot(x, [-i for i in y1], marker='o', linestyle='-', color='b', label='what_caption_generation') # 绘制折线，并设置数据点标记、线条样式和颜色
plt.plot(x, [-i for i in y], marker='o', linestyle='-', color='r', label='caption_generation')
plt.xlabel('token') # X轴标签
plt.ylabel('log-likelihood') # Y轴标签
plt.grid(True) # 显示网格
plt.legend()
plt.show() # 显示图表


str_a = "{} is a good shirt. {}, {}"
str_b = str_a.replace('{}', 'toptee')
print(str_b)

a = [', '.join([cc.strip('.?, ') for cc in c]) for c in ['I love cat.', 'I love dog.']]
print(a)

x = np.array([1, 5, 10, 20, 30, 50, 100, 200, 300, 400])
y = np.array([0.036310108, 0.098135427, 0.139842983, 0.194798822, 0.239450442, 0.291462218, 0.390578999, 0.490186457, 0.557409225, 0.602060844])
y1 = np.array([0.017174, 0.045633, 0.073602, 0.110402, 0.143768, 0.186457, 0.267419, 0.368989, 0.43474, 0.483808])
y2 = np.array([0.029441, 0.067223, 0.097154, 0.126104, 0.152601, 0.189401, 0.24632, 0.3263, 0.382237, 0.424926])
y3 = np.array([0.035329, 0.098626, 0.152601, 0.2105, 0.249755, 0.314033, 0.402355, 0.508342, 0.569676, 0.621688])
y4 = np.array([0.048086, 0.118253, 0.160942, 0.214917, 0.255152, 0.308636, 0.400393, 0.504907, 0.574583, 0.62316])
plt.figure()
plt.plot(x, [i*100 for i in y], marker='o', linestyle='-', color='g', label='dense') # 绘制折线，并设置数据点标记、线条样式和颜色
plt.plot(x, [i*100 for i in y1], marker='o', linestyle='-', color='b', label='perspective sparse 20') # 绘制折线，并设置数据点标记、线条样式和颜色
plt.plot(x, [i*100 for i in y2], marker='o', linestyle='-', color='r', label='sparse 128')
plt.plot(x, [i*100 for i in y3], marker='^', linestyle='-', color='b', label='perspective hybrid 20') # 绘制折线，并设置数据点标记、线条样式和颜色
plt.plot(x, [i*100 for i in y4], marker='^', linestyle='-', color='r', label='hybrid 128')
plt.xlabel('k') # X轴标签
plt.ylabel('r@k') # Y轴标签
plt.grid(True) # 显示网格
plt.legend()
plt.title('shirt')
plt.show() # 显示图表

y = np.array([0.027268, 0.090729, 0.131383, 0.188399, 0.226078, 0.285077, 0.39762, 0.521567, 0.600397, 0.663857])
y1 = np.array([0.014378, 0.043133, 0.072385, 0.113039, 0.145761, 0.194844, 0.275161, 0.371839, 0.445711, 0.499256])
y2 = np.array([0.002479, 0.019831, 0.02826, 0.043133, 0.052553, 0.076351, 0.128409, 0.189886, 0.238473, 0.283589])
y3 = np.array([0.032226, 0.093208, 0.133862, 0.196827, 0.244422, 0.307883, 0.411502, 0.534953, 0.610312, 0.670302])
y4 = np.array([0.030243, 0.086267, 0.119484, 0.165592, 0.207734, 0.271691, 0.367377, 0.483887, 0.565692, 0.635597])
plt.figure()
plt.plot(x, [i*100 for i in y], marker='o', linestyle='-', color='g', label='dense') # 绘制折线，并设置数据点标记、线条样式和颜色
plt.plot(x, [i*100 for i in y1], marker='o', linestyle='-', color='b', label='perspective sparse 20') # 绘制折线，并设置数据点标记、线条样式和颜色
plt.plot(x, [i*100 for i in y2], marker='o', linestyle='-', color='r', label='sparse 128')
plt.plot(x, [i*100 for i in y3], marker='^', linestyle='-', color='b', label='perspective hybrid 20') # 绘制折线，并设置数据点标记、线条样式和颜色
plt.plot(x, [i*100 for i in y4], marker='^', linestyle='-', color='r', label='hybrid 128')
plt.xlabel('k') # X轴标签
plt.ylabel('r@k') # Y轴标签
plt.grid(True) # 显示网格
plt.legend()
plt.title('dress')

plt.show() # 显示图表
y = np.array([0.037736, 0.107598, 0.154003, 0.219786, 0.261091, 0.319225, 0.413565, 0.515553, 0.582356, 0.626721])
y1 = np.array([0.012239, 0.049465, 0.080571, 0.122896, 0.156553, 0.199898, 0.279449, 0.374809, 0.444161, 0.486486])
y2 = np.array([0.025497, 0.053034, 0.071902, 0.103009, 0.124936, 0.151453, 0.198368, 0.27588, 0.335033, 0.376339])
y3 = np.array([0.036206, 0.105558, 0.160122, 0.226415, 0.27027, 0.334013, 0.425293, 0.531871, 0.596124, 0.6359])
y4 = np.array([0.048445, 0.109128, 0.166752, 0.231515, 0.27282, 0.329424, 0.420704, 0.531362, 0.592555, 0.63488])
plt.figure()
plt.plot(x, [i*100 for i in y], marker='o', linestyle='-', color='g', label='dense') # 绘制折线，并设置数据点标记、线条样式和颜色
plt.plot(x, [i*100 for i in y1], marker='o', linestyle='-', color='b', label='perspective sparse 20') # 绘制折线，并设置数据点标记、线条样式和颜色
plt.plot(x, [i*100 for i in y2], marker='o', linestyle='-', color='r', label='sparse 128')
plt.plot(x, [i*100 for i in y3], marker='^', linestyle='-', color='b', label='perspective hybrid 20') # 绘制折线，并设置数据点标记、线条样式和颜色
plt.plot(x, [i*100 for i in y4], marker='^', linestyle='-', color='r', label='hybrid 128')
plt.xlabel('k') # X轴标签
plt.ylabel('r@k') # Y轴标签
plt.grid(True) # 显示网格
plt.legend()
plt.title('toptee')
plt.show() # 显示图表

x = np.array([1, 5, 10, 20])
y1 = np.array([0.054956, 0.125613, 0.168793, 0.2105])
y2 = np.array([0.035329, 0.098626, 0.152601, 0.2105])
plt.figure()
plt.plot(x, [i*100 for i in y1], marker='o', linestyle='-', color='r', label='after rerank') # 绘制折线，并设置数据点标记、线条样式和颜色
plt.plot(x, [i*100 for i in y2], marker='o', linestyle='-', color='b', label='before rerank') # 绘制折线，并设置数据点标记、线条样式和颜色
plt.xlabel('k') # X轴标签
plt.ylabel('r@k') # Y轴标签
plt.grid(True) # 显示网格
plt.legend()
plt.title('shirt')
plt.show() # 显示图表

y1 = np.array([0.033218, 0.111056, 0.156173, 0.196827])
y2 = np.array([0.032226, 0.093208, 0.133862, 0.196827])
plt.figure()
plt.plot(x, [i*100 for i in y1], marker='o', linestyle='-', color='r', label='after rerank') # 绘制折线，并设置数据点标记、线条样式和颜色
plt.plot(x, [i*100 for i in y2], marker='o', linestyle='-', color='b', label='before rerank') # 绘制折线，并设置数据点标记、线条样式和颜色
plt.xlabel('k') # X轴标签
plt.ylabel('r@k') # Y轴标签
plt.grid(True) # 显示网格
plt.legend()
plt.title('dress')
plt.show() # 显示图表

y1 = np.array([0.062723, 0.139725, 0.175931, 0.226415])
y2 = np.array([0.036206, 0.105558, 0.160122, 0.226415])
plt.figure()
plt.plot(x, [i*100 for i in y1], marker='o', linestyle='-', color='r', label='after rerank') # 绘制折线，并设置数据点标记、线条样式和颜色
plt.plot(x, [i*100 for i in y2], marker='o', linestyle='-', color='b', label='before rerank') # 绘制折线，并设置数据点标记、线条样式和颜色
plt.xlabel('k') # X轴标签
plt.ylabel('r@k') # Y轴标签
plt.grid(True) # 显示网格
plt.legend()
plt.title('toptee')
plt.show() # 显示图表
